garyPenhook/PIC-Assembler/edc/PIC18F26Q24.PIC
        <edc:SFRDef edc:access="-------n" edc:cname="ICSPEN" edc:desc="" edc:impl="0x1" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------0" edc:name="ICSPEN" edc:nzwidth="8" edc:por="-------0" edc:_addr="0x39">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EN" edc:mask="0x1" edc:name="EN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="n--nnnnn" edc:cname="CLKRCON" edc:desc="" edc:impl="0x9f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0--10000" edc:name="CLKRCON" edc:nzwidth="8" edc:por="0--10000" edc:_modsrc="DOS-02548_clk_refout_v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x2" edc:_addr="0x3A">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DIV" edc:mask="0x7" edc:name="DIV" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="DC" edc:mask="0x3" edc:name="DC" edc:nzwidth="0x2"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="EN" edc:desc="" edc:mask="0x1" edc:name="EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CLKRDIV0" edc:mask="0x1" edc:name="CLKRDIV0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLKRDIV1" edc:mask="0x1" edc:name="CLKRDIV1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLKRDIV2" edc:mask="0x1" edc:name="CLKRDIV2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLKRDC0" edc:mask="0x1" edc:name="CLKRDC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLKRDC1" edc:mask="0x1" edc:name="CLKRDC1" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="CLKREN" edc:desc="" edc:mask="0x1" edc:name="CLKREN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="DIV0" edc:mask="0x1" edc:name="DIV0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DIV1" edc:mask="0x1" edc:name="DIV1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DIV2" edc:mask="0x1" edc:name="DIV2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DC0" edc:mask="0x1" edc:name="DC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DC1" edc:mask="0x1" edc:name="DC1" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----nnnn" edc:cname="CLKRCLK" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000" edc:name="CLKRCLK" edc:nzwidth="8" edc:por="----0000" edc:_modsrc="DOS-02548_clk_refout_v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x2" edc:_addr="0x3B">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CLK" edc:desc="" edc:mask="0xf" edc:name="CLK" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CLKRCLK0" edc:mask="0x1" edc:name="CLKRCLK0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLKRCLK1" edc:mask="0x1" edc:name="CLKRCLK1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLKRCLK2" edc:mask="0x1" edc:name="CLKRCLK2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLKRCLK3" edc:mask="0x1" edc:name="CLKRCLK3" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="CLK0" edc:mask="0x1" edc:name="CLK0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLK1" edc:mask="0x1" edc:name="CLK1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLK2" edc:mask="0x1" edc:name="CLK2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLK3" edc:mask="0x1" edc:name="CLK3" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="0x04" edc:_addr="0x3C"/>
        <edc:SFRDef edc:access="-------n" edc:cname="NVMCON0" edc:desc="" edc:impl="0x1" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------u" edc:name="NVMCON0" edc:nzwidth="8" edc:por="-------x" edc:_addr="0x40">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="GO" edc:mask="0x1" edc:name="GO" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="nDONE" edc:mask="0x1" edc:name="nDONE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="NVMGO" edc:mask="0x1" edc:name="NVMGO" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="n----nnn" edc:cname="NVMCON1" edc:desc="" edc:impl="0x87" edc:isindirect="false" edc:isvolatile="true" edc:mclr="u----uuu" edc:name="NVMCON1" edc:nzwidth="8" edc:por="x----xxx" edc:_addr="0x41">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CMD" edc:mask="0x7" edc:name="CMD" edc:nzwidth="0x3"/>
              <edc:AdjustPoint edc:offset="0x4"/>
              <edc:SFRFieldDef edc:cname="WRERR" edc:mask="0x1" edc:name="WRERR" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="NVMCMD" edc:mask="0x7" edc:name="NVMCMD" edc:nzwidth="0x3"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="NVMLOCK" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="NVMLOCK" edc:nzwidth="8" edc:por="00000000" edc:_addr="0x42">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LOCK" edc:mask="0xff" edc:name="LOCK" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
