garyPenhook/PIC-Assembler/edc/PIC18F26Q24.PIC
        <edc:SFRDef edc:access="nr-n-nnn" edc:cname="CM1CON0" edc:desc="COMPARATOR CONTROL REGISTER 0" edc:impl="0xd7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00-0-uu0" edc:name="CM1CON0" edc:nzwidth="8" edc:por="00-0-xx0" edc:_modsrc="DOS-05121_cmp_rr_ctrl_v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x70">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SYNC" edc:desc="Comparator Output Synchronous Mode bit" edc:mask="0x1" edc:name="SYNC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="HYS" edc:desc="Comparator Hysteresis Enable bit" edc:mask="0x3" edc:name="HYS" edc:nzwidth="0x2"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="POL" edc:desc="Comparator Output Polarity Select bit" edc:mask="0x1" edc:name="POL" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="OUT" edc:desc="Comparator Output bit" edc:mask="0x1" edc:name="OUT" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EN" edc:desc="Comparator Enable bit" edc:mask="0x1" edc:name="EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.1">
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="HYS0" edc:desc="Comparator Hysteresis Enable bit" edc:mask="0x1" edc:name="HYS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="HYS1" edc:desc="Comparator Hysteresis Enable bit" edc:mask="0x1" edc:name="HYS1" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="C1SYNC" edc:desc="Comparator Output Synchronous Mode bit" edc:mask="0x1" edc:name="C1SYNC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C1HYS" edc:desc="Comparator Hysteresis Enable bit" edc:mask="0x1" edc:name="C1HYS" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C1HYS1" edc:desc="Comparator Hysteresis Enable bit" edc:mask="0x1" edc:name="C1HYS1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="C1POL" edc:desc="Comparator Output Polarity Select bit" edc:mask="0x1" edc:name="C1POL" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="C1OUT" edc:desc="Comparator Output bit" edc:mask="0x1" edc:name="C1OUT" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C1EN" edc:desc="Comparator Enable bit" edc:mask="0x1" edc:name="C1EN" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="n---nnnn" edc:cname="CM1CON1" edc:desc="COMPARATOR CONTROL REGISTER 1" edc:impl="0x8f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="u---uu00" edc:name="CM1CON1" edc:nzwidth="8" edc:por="x---xx00" edc:_modsrc="DOS-05121_cmp_rr_ctrl_v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x71">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="INTN" edc:desc="Comparator Interrupt on Negative going edge Enable bits" edc:mask="0x1" edc:name="INTN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INTP" edc:desc="Comparator Interrupt on Positive going edge Enable bits" edc:mask="0x1" edc:name="INTP" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SP" edc:mask="0x3" edc:name="SP" edc:nzwidth="0x2"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="RDY" edc:mask="0x1" edc:name="RDY" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.1">
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="SP0" edc:mask="0x1" edc:name="SP0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SP1" edc:mask="0x1" edc:name="SP1" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="C1INTN" edc:desc="Comparator Interrupt on Negative going edge Enable bits" edc:mask="0x1" edc:name="C1INTN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C1INTP" edc:desc="Comparator Interrupt on Positive going edge Enable bits" edc:mask="0x1" edc:name="C1INTP" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C1SP0" edc:desc="Comparator Speed/Power Select bit" edc:mask="0x1" edc:name="C1SP0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="C1SP1" edc:mask="0x1" edc:name="C1SP1" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="C1RDY" edc:mask="0x1" edc:name="C1RDY" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-----nnn" edc:cname="CM1NCH" edc:desc="COMPARATOR INVERTING CHANNEL SELECT REGISTER" edc:impl="0x7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----000" edc:name="CM1NCH" edc:nzwidth="8" edc:por="-----000" edc:_modsrc="DOS-05121_cmp_rr_ctrl_v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x72">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="NCH" edc:desc="Comparator Inverting Input Channel Select bits" edc:mask="0x7" edc:name="NCH" edc:nzwidth="3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.1">
              <edc:SFRFieldDef edc:cname="NCH0" edc:desc="Comparator Inverting Input Channel Select bits" edc:mask="0x1" edc:name="NCH0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="NCH1" edc:desc="Comparator Inverting Input Channel Select bits" edc:mask="0x1" edc:name="NCH1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="NCH2" edc:desc="Comparator Inverting Input Channel Select bits" edc:mask="0x1" edc:name="NCH2" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="C1NCH0" edc:desc="Comparator Inverting Input Channel Select bits" edc:mask="0x1" edc:name="C1NCH0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C1NCH1" edc:desc="Comparator Inverting Input Channel Select bits" edc:mask="0x1" edc:name="C1NCH1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C1NCH2" edc:desc="Comparator Inverting Input Channel Select bits" edc:mask="0x1" edc:name="C1NCH2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-----nnn" edc:cname="CM1PCH" edc:desc="COMPARATOR NON-INVERTING CHANNEL SELECT REGISTER" edc:impl="0x7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----000" edc:name="CM1PCH" edc:nzwidth="8" edc:por="-----000" edc:_modsrc="DOS-05121_cmp_rr_ctrl_v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x73">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PCH" edc:desc="Comparator Non-Inverting Input Channel Select bits" edc:mask="0x7" edc:name="PCH" edc:nzwidth="3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.1">
              <edc:SFRFieldDef edc:cname="PCH0" edc:desc="Comparator Non-Inverting Input Channel Select bits" edc:mask="0x1" edc:name="PCH0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PCH1" edc:desc="Comparator Non-Inverting Input Channel Select bits" edc:mask="0x1" edc:name="PCH1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PCH2" edc:desc="Comparator Non-Inverting Input Channel Select bits" edc:mask="0x1" edc:name="PCH2" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="C1PCH0" edc:desc="Comparator Non-Inverting Input Channel Select bits" edc:mask="0x1" edc:name="C1PCH0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C1PCH1" edc:desc="Comparator Non-Inverting Input Channel Select bits" edc:mask="0x1" edc:name="C1PCH1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C1PCH2" edc:desc="Comparator Non-Inverting Input Channel Select bits" edc:mask="0x1" edc:name="C1PCH2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nr-n-nnn" edc:cname="CM2CON0" edc:desc="COMPARATOR CONTROL REGISTER 0" edc:impl="0xd7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00-0-uu0" edc:name="CM2CON0" edc:nzwidth="8" edc:por="00-0-xx0" edc:_modsrc="DOS-05121_cmp_rr_ctrl_v3.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x74">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SYNC" edc:desc="Comparator Output Synchronous Mode bit" edc:mask="0x1" edc:name="SYNC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="HYS" edc:desc="Comparator Hysteresis Enable bit" edc:mask="0x3" edc:name="HYS" edc:nzwidth="0x2"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="POL" edc:desc="Comparator Output Polarity Select bit" edc:mask="0x1" edc:name="POL" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="OUT" edc:desc="Comparator Output bit" edc:mask="0x1" edc:name="OUT" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EN" edc:desc="Comparator Enable bit" edc:mask="0x1" edc:name="EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.1">
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="HYS0" edc:desc="Comparator Hysteresis Enable bit" edc:mask="0x1" edc:name="HYS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="HYS1" edc:desc="Comparator Hysteresis Enable bit" edc:mask="0x1" edc:name="HYS1" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="C2SYNC" edc:desc="Comparator Output Synchronous Mode bit" edc:mask="0x1" edc:name="C2SYNC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C2HYS" edc:desc="Comparator Hysteresis Enable bit" edc:mask="0x1" edc:name="C2HYS" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C2HYS1" edc:desc="Comparator Hysteresis Enable bit" edc:mask="0x1" edc:name="C2HYS1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="C2POL" edc:desc="Comparator Output Polarity Select bit" edc:mask="0x1" edc:name="C2POL" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="C2OUT" edc:desc="Comparator Output bit" edc:mask="0x1" edc:name="C2OUT" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C2EN" edc:desc="Comparator Enable bit" edc:mask="0x1" edc:name="C2EN" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
