garyPenhook/PIC-Assembler/edc/PIC18F26Q24.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PORTB" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="PORTB" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0x151">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RB0" edc:desc="" edc:mask="0x1" edc:name="RB0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB1" edc:desc="" edc:mask="0x1" edc:name="RB1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB2" edc:desc="" edc:mask="0x1" edc:name="RB2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB3" edc:desc="" edc:mask="0x1" edc:name="RB3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB4" edc:desc="" edc:mask="0x1" edc:name="RB4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB5" edc:desc="" edc:mask="0x1" edc:name="RB5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB6" edc:desc="" edc:mask="0x1" edc:name="RB6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB7" edc:desc="" edc:mask="0x1" edc:name="RB7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PORTC" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="PORTC" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0x152">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RC0" edc:desc="" edc:mask="0x1" edc:name="RC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC1" edc:desc="" edc:mask="0x1" edc:name="RC1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC2" edc:desc="" edc:mask="0x1" edc:name="RC2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC3" edc:desc="" edc:mask="0x1" edc:name="RC3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC4" edc:desc="" edc:mask="0x1" edc:name="RC4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC5" edc:desc="" edc:mask="0x1" edc:name="RC5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC6" edc:desc="" edc:mask="0x1" edc:name="RC6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC7" edc:mask="0x1" edc:name="RC7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="0x1" edc:_addr="0x153"/>
        <edc:SFRDef edc:access="----r---" edc:cname="PORTE" edc:desc="" edc:impl="0x8" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----u---" edc:name="PORTE" edc:nzwidth="0x8" edc:por="----x---" edc:_addr="0x154">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="RE3" edc:desc="" edc:mask="0x1" edc:name="RE3" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="0xAB" edc:_addr="0x155"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="0x2" edc:beginaddr="0x0200" edc:endaddr="0x0300" edc:regionid="sfr2">
        <edc:SFRDef edc:access="-------n" edc:cname="PPSLOCK" edc:desc="" edc:impl="0x1" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------0" edc:name="PPSLOCK" edc:nzwidth="8" edc:por="-------0" edc:_addr="0x200">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PPSLOCKED" edc:mask="0x1" edc:name="PPSLOCKED" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="RA0PPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="RA0PPS" edc:nzwidth="8" edc:por="--000000" edc:_modsrc="DOS-xxxxx-pps-mid-v2-output-8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x201">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RA0PPS0" edc:mask="0x1" edc:name="RA0PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA0PPS1" edc:mask="0x1" edc:name="RA0PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA0PPS2" edc:mask="0x1" edc:name="RA0PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA0PPS3" edc:mask="0x1" edc:name="RA0PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA0PPS4" edc:mask="0x1" edc:name="RA0PPS4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA0PPS5" edc:mask="0x1" edc:name="RA0PPS5" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="RA1PPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="RA1PPS" edc:nzwidth="8" edc:por="--000000" edc:_modsrc="DOS-xxxxx-pps-mid-v2-output-8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x202">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RA1PPS0" edc:mask="0x1" edc:name="RA1PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA1PPS1" edc:mask="0x1" edc:name="RA1PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA1PPS2" edc:mask="0x1" edc:name="RA1PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA1PPS3" edc:mask="0x1" edc:name="RA1PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA1PPS4" edc:mask="0x1" edc:name="RA1PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA1PPS5" edc:mask="0x1" edc:name="RA1PPS5" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="RA2PPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="RA2PPS" edc:nzwidth="8" edc:por="--000000" edc:_modsrc="DOS-xxxxx-pps-mid-v2-output-8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x203">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RA2PPS0" edc:mask="0x1" edc:name="RA2PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA2PPS1" edc:mask="0x1" edc:name="RA2PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA2PPS2" edc:mask="0x1" edc:name="RA2PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA2PPS3" edc:mask="0x1" edc:name="RA2PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA2PPS4" edc:mask="0x1" edc:name="RA2PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA2PPS5" edc:mask="0x1" edc:name="RA2PPS5" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="RA3PPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="RA3PPS" edc:nzwidth="8" edc:por="--000000" edc:_modsrc="DOS-xxxxx-pps-mid-v2-output-8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x204">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RA3PPS0" edc:mask="0x1" edc:name="RA3PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA3PPS1" edc:mask="0x1" edc:name="RA3PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA3PPS2" edc:mask="0x1" edc:name="RA3PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA3PPS3" edc:mask="0x1" edc:name="RA3PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA3PPS4" edc:mask="0x1" edc:name="RA3PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA3PPS5" edc:mask="0x1" edc:name="RA3PPS5" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="RA4PPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="RA4PPS" edc:nzwidth="8" edc:por="--000000" edc:_modsrc="DOS-xxxxx-pps-mid-v2-output-8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x205">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RA4PPS0" edc:mask="0x1" edc:name="RA4PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA4PPS1" edc:mask="0x1" edc:name="RA4PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA4PPS2" edc:mask="0x1" edc:name="RA4PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA4PPS3" edc:mask="0x1" edc:name="RA4PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA4PPS4" edc:mask="0x1" edc:name="RA4PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA4PPS5" edc:mask="0x1" edc:name="RA4PPS5" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
