garyPenhook/PIC-Assembler/edc/PIC18F26Q24.PIC
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="I2C1CNTH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="I2C1CNTH" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-04803_i2c_8bit_v5.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x17" edc:_addr="0x28B">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="CNT" edc:mask="0xff" edc:name="CNT" edc:nzwidth="0x8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="CNT8" edc:mask="0x1" edc:name="CNT8" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="CNT9" edc:mask="0x1" edc:name="CNT9" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="CNT10" edc:mask="0x1" edc:name="CNT10" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="CNT11" edc:mask="0x1" edc:name="CNT11" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="CNT12" edc:mask="0x1" edc:name="CNT12" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="CNT13" edc:mask="0x1" edc:name="CNT13" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="CNT14" edc:mask="0x1" edc:name="CNT14" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="CNT15" edc:mask="0x1" edc:name="CNT15" edc:nzwidth="0x1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="I2C1CNT" edc:mask="0xff" edc:name="I2C1CNT" edc:nzwidth="0x8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.2">
                <edc:SFRFieldDef edc:cname="I2C1CNT8" edc:mask="0x1" edc:name="I2C1CNT8" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="I2C1CNT9" edc:mask="0x1" edc:name="I2C1CNT9" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="I2C1CNT10" edc:mask="0x1" edc:name="I2C1CNT10" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="I2C1CNT11" edc:mask="0x1" edc:name="I2C1CNT11" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="I2C1CNT12" edc:mask="0x1" edc:name="I2C1CNT12" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="I2C1CNT13" edc:mask="0x1" edc:name="I2C1CNT13" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="I2C1CNT14" edc:mask="0x1" edc:name="I2C1CNT14" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="I2C1CNT15" edc:mask="0x1" edc:name="I2C1CNT15" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="I2C1ADB0" edc:desc="I2C ADDRESS BUFFER  REGISTER 0" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="I2C1ADB0" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-04803_i2c_8bit_v5.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x17" edc:_addr="0x28C">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADB" edc:mask="0xff" edc:name="ADB" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="I2C1ADB1" edc:desc="I2C ADDRESS BUFFER  REGISTER 1" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="I2C1ADB1" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-04803_i2c_8bit_v5.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x17" edc:_addr="0x28D">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADB" edc:mask="0xff" edc:name="ADB" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="I2C1ADR0" edc:desc="I2C ADDRESS REGISTER 0" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111111" edc:name="I2C1ADR0" edc:nzwidth="8" edc:por="11111111" edc:_modsrc="DOS-04803_i2c_8bit_v5.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x17" edc:_addr="0x28E">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADR" edc:mask="0xff" edc:name="ADR" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnn-" edc:cname="I2C1ADR1" edc:desc="I2C ADDRESS REGISTER 1" edc:impl="0xfe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111110" edc:name="I2C1ADR1" edc:nzwidth="8" edc:por="11111110" edc:_modsrc="DOS-04803_i2c_8bit_v5.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x17" edc:_addr="0x28F">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="ADR" edc:mask="0x7f" edc:name="ADR" edc:nzwidth="0x7"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="I2C1ADR2" edc:desc="I2C ADDRESS REGISTER 2" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111111" edc:name="I2C1ADR2" edc:nzwidth="8" edc:por="11111111" edc:_modsrc="DOS-04803_i2c_8bit_v5.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x17" edc:_addr="0x290">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADR" edc:mask="0xff" edc:name="ADR" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnn-" edc:cname="I2C1ADR3" edc:desc="I2C ADDRESS REGISTER 3" edc:impl="0xfe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="1111111-" edc:name="I2C1ADR3" edc:nzwidth="8" edc:por="1111111-" edc:_modsrc="DOS-04803_i2c_8bit_v5.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x17" edc:_addr="0x291">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="ADR" edc:mask="0x7f" edc:name="ADR" edc:nzwidth="0x7"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
