garyPenhook/PIC-Assembler/edc/PIC18F26Q24.PIC
        <edc:JoinedSFRDef edc:cname="I2C2CNT" edc:desc="" edc:name="I2C2CNT" edc:nzwidth="0x10" edc:_modsrc="DOS-04803_i2c_8bit_v5.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x17" edc:_addr="0x2A1">
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="I2C2CNTL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="I2C2CNTL" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-04803_i2c_8bit_v5.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x17" edc:_addr="0x2A1">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="CNT" edc:mask="0xff" edc:name="CNT" edc:nzwidth="0x8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="CNT0" edc:mask="0x1" edc:name="CNT0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="CNT1" edc:mask="0x1" edc:name="CNT1" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="CNT2" edc:mask="0x1" edc:name="CNT2" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="CNT3" edc:mask="0x1" edc:name="CNT3" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="CNT4" edc:mask="0x1" edc:name="CNT4" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="CNT5" edc:mask="0x1" edc:name="CNT5" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="CNT6" edc:mask="0x1" edc:name="CNT6" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="CNT7" edc:mask="0x1" edc:name="CNT7" edc:nzwidth="0x1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="I2C2CNT" edc:mask="0xff" edc:name="I2C2CNT" edc:nzwidth="0x8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.2">
                <edc:SFRFieldDef edc:cname="I2C2CNT0" edc:mask="0x1" edc:name="I2C2CNT0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="I2C2CNT1" edc:mask="0x1" edc:name="I2C2CNT1" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="I2C2CNT2" edc:mask="0x1" edc:name="I2C2CNT2" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="I2C2CNT3" edc:mask="0x1" edc:name="I2C2CNT3" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="I2C2CNT4" edc:mask="0x1" edc:name="I2C2CNT4" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="I2C2CNT5" edc:mask="0x1" edc:name="I2C2CNT5" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="I2C2CNT6" edc:mask="0x1" edc:name="I2C2CNT6" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="I2C2CNT7" edc:mask="0x1" edc:name="I2C2CNT7" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="I2C2CNTH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="I2C2CNTH" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-04803_i2c_8bit_v5.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x17" edc:_addr="0x2A2">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="CNT" edc:mask="0xff" edc:name="CNT" edc:nzwidth="0x8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="CNT8" edc:mask="0x1" edc:name="CNT8" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="CNT9" edc:mask="0x1" edc:name="CNT9" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="CNT10" edc:mask="0x1" edc:name="CNT10" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="CNT11" edc:mask="0x1" edc:name="CNT11" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="CNT12" edc:mask="0x1" edc:name="CNT12" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="CNT13" edc:mask="0x1" edc:name="CNT13" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="CNT14" edc:mask="0x1" edc:name="CNT14" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="CNT15" edc:mask="0x1" edc:name="CNT15" edc:nzwidth="0x1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="I2C2CNT" edc:mask="0xff" edc:name="I2C2CNT" edc:nzwidth="0x8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.2">
                <edc:SFRFieldDef edc:cname="I2C2CNT8" edc:mask="0x1" edc:name="I2C2CNT8" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="I2C2CNT9" edc:mask="0x1" edc:name="I2C2CNT9" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="I2C2CNT10" edc:mask="0x1" edc:name="I2C2CNT10" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="I2C2CNT11" edc:mask="0x1" edc:name="I2C2CNT11" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="I2C2CNT12" edc:mask="0x1" edc:name="I2C2CNT12" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="I2C2CNT13" edc:mask="0x1" edc:name="I2C2CNT13" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="I2C2CNT14" edc:mask="0x1" edc:name="I2C2CNT14" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="I2C2CNT15" edc:mask="0x1" edc:name="I2C2CNT15" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="I2C2ADB0" edc:desc="I2C ADDRESS BUFFER  REGISTER 0" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="I2C2ADB0" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-04803_i2c_8bit_v5.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x17" edc:_addr="0x2A3">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADB" edc:mask="0xff" edc:name="ADB" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="I2C2ADB1" edc:desc="I2C ADDRESS BUFFER  REGISTER 1" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="I2C2ADB1" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-04803_i2c_8bit_v5.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x17" edc:_addr="0x2A4">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADB" edc:mask="0xff" edc:name="ADB" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
