garyPenhook/PIC-Assembler/edc/PIC18F26Q24.PIC
        <edc:SFRDef edc:access="n-rnnnnn" edc:cname="T0CON0" edc:desc="" edc:impl="0xbf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0-000000" edc:name="T0CON0" edc:nzwidth="8" edc:por="0-000000" edc:_modsrc="DOS-01631_tmr_mid0_v1_8bit_rev2.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x31A">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="OUTPS" edc:desc="" edc:mask="0xf" edc:name="OUTPS" edc:nzwidth="4"/>
              <edc:SFRFieldDef edc:cname="MD16" edc:desc="" edc:mask="0x1" edc:name="MD16" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OUT" edc:desc="" edc:mask="0x1" edc:name="OUT" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="EN" edc:desc="" edc:mask="0x1" edc:name="EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="T0OUTPS" edc:mask="0xf" edc:name="T0OUTPS" edc:nzwidth="0x4"/>
              <edc:SFRFieldDef edc:cname="T0MD16" edc:mask="0x1" edc:name="T0MD16" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T0OUT" edc:mask="0x1" edc:name="T0OUT" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="T0EN" edc:mask="0x1" edc:name="T0EN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="OUTPS0" edc:mask="0x1" edc:name="OUTPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OUTPS1" edc:mask="0x1" edc:name="OUTPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OUTPS2" edc:mask="0x1" edc:name="OUTPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OUTPS3" edc:mask="0x1" edc:name="OUTPS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T016BIT" edc:mask="0x1" edc:name="T016BIT" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="T0OUTPS0" edc:mask="0x1" edc:name="T0OUTPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T0OUTPS1" edc:mask="0x1" edc:name="T0OUTPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T0OUTPS2" edc:mask="0x1" edc:name="T0OUTPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T0OUTPS3" edc:mask="0x1" edc:name="T0OUTPS3" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="T0CON1" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="T0CON1" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-01631_tmr_mid0_v1_8bit_rev2.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x31B">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CKPS" edc:desc="" edc:mask="0xf" edc:name="CKPS" edc:nzwidth="4"/>
              <edc:SFRFieldDef edc:cname="ASYNC" edc:desc="" edc:mask="0x1" edc:name="ASYNC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CS" edc:desc="" edc:mask="0x7" edc:name="CS" edc:nzwidth="3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CKPS0" edc:mask="0x1" edc:name="CKPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CKPS1" edc:mask="0x1" edc:name="CKPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CKPS2" edc:mask="0x1" edc:name="CKPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CKPS3" edc:mask="0x1" edc:name="CKPS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T0ASYNC" edc:mask="0x1" edc:name="T0ASYNC" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CS0" edc:mask="0x1" edc:name="CS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CS1" edc:mask="0x1" edc:name="CS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CS2" edc:mask="0x1" edc:name="CS2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="T0CKPS" edc:mask="0xf" edc:name="T0CKPS" edc:nzwidth="0x4"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="T0CS" edc:mask="0x7" edc:name="T0CS" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="T0CKPS0" edc:mask="0x1" edc:name="T0CKPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T0CKPS1" edc:mask="0x1" edc:name="T0CKPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T0CKPS2" edc:mask="0x1" edc:name="T0CKPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T0CKPS3" edc:mask="0x1" edc:name="T0CKPS3" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="T0CS0" edc:mask="0x1" edc:name="T0CS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T0CS1" edc:mask="0x1" edc:name="T0CS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T0CS2" edc:mask="0x1" edc:name="T0CS2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="0x1" edc:_addr="0x31C"/>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="T2TMR" edc:desc="8-bit period timer" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="T2TMR" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02777_tmr_mid2_v2_generic.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x6" edc:_addr="0x31D">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="TMR2"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TMR2" edc:desc="" edc:mask="0xff" edc:name="TMR2" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
