garyPenhook/PIC-Assembler/edc/PIC18F26Q24.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PIR2" edc:desc="" edc:impl="0xe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="PIR2" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-xxxx_Interrupts_Q24_8bit.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0xc" edc:_addr="0x4B8">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ZCD2IF" edc:mask="0x1" edc:name="ZCD2IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLC5IF" edc:mask="0x1" edc:name="CLC5IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCSRIF" edc:mask="0x1" edc:name="IOCSRIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ZCD1IF" edc:mask="0x1" edc:name="ZCD1IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA1SCNTIF" edc:mask="0x1" edc:name="DMA1SCNTIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA1DCNTIF" edc:mask="0x1" edc:name="DMA1DCNTIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA1ORIF" edc:mask="0x1" edc:name="DMA1ORIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA1AIF" edc:mask="0x1" edc:name="DMA1AIF" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnrrr" edc:cname="PIR3" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="PIR3" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-xxxx_Interrupts_Q24_8bit.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0xc" edc:_addr="0x4B9">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SPI1RXIF" edc:mask="0x1" edc:name="SPI1RXIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI1TXIF" edc:mask="0x1" edc:name="SPI1TXIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI1IF" edc:mask="0x1" edc:name="SPI1IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR2IF" edc:mask="0x1" edc:name="TMR2IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR1IF" edc:mask="0x1" edc:name="TMR1IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR1GIF" edc:mask="0x1" edc:name="TMR1GIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CCP1IF" edc:mask="0x1" edc:name="CCP1IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR0IF" edc:mask="0x1" edc:name="TMR0IF" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnrrrr" edc:cname="PIR4" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="PIR4" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-xxxx_Interrupts_Q24_8bit.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0xc" edc:_addr="0x4BA">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="U1RXIF" edc:mask="0x1" edc:name="U1RXIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U1TXIF" edc:mask="0x1" edc:name="U1TXIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U1EIF" edc:mask="0x1" edc:name="U1EIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U1IF" edc:mask="0x1" edc:name="U1IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR3IF" edc:mask="0x1" edc:name="TMR3IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR3GIF" edc:mask="0x1" edc:name="TMR3GIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWM1PIF" edc:mask="0x1" edc:name="PWM1PIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWM1IF" edc:mask="0x1" edc:name="PWM1IF" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rnnnnrn-" edc:cname="PIR5" edc:desc="" edc:impl="0xfe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000-" edc:name="PIR5" edc:nzwidth="8" edc:por="0000000-" edc:_modsrc="DOS-xxxx_Interrupts_Q24_8bit.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0xc" edc:_addr="0x4BB">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="CLC6IF" edc:mask="0x1" edc:name="CLC6IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TU16AIF" edc:mask="0x1" edc:name="TU16AIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR6IF" edc:mask="0x1" edc:name="TMR6IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="C2IF" edc:mask="0x1" edc:name="C2IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLC2IF" edc:mask="0x1" edc:name="CLC2IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWM2PIF" edc:mask="0x1" edc:name="PWM2PIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWM2IF" edc:mask="0x1" edc:name="PWM2IF" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PIR6" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="PIR6" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-xxxx_Interrupts_Q24_8bit.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0xc" edc:_addr="0x4BC">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="INT1IF" edc:mask="0x1" edc:name="INT1IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLC7IF" edc:mask="0x1" edc:name="CLC7IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWG1IF" edc:mask="0x1" edc:name="CWG1IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="NCO1IF" edc:mask="0x1" edc:name="NCO1IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA2SCNTIF" edc:mask="0x1" edc:name="DMA2SCNTIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA2DCNTIF" edc:mask="0x1" edc:name="DMA2DCNTIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA2ORIF" edc:mask="0x1" edc:name="DMA2ORIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA2AIF" edc:mask="0x1" edc:name="DMA2AIF" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
